Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_rcc.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32L4R5_rcc.
; ==============

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32L4R5_rcc equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// RCC address definitions
// -----------------------

typedef struct {
    volatile    uint32_t    CR;
    volatile    uint32_t    ICSCR;
    volatile    uint32_t    CFGR;
    volatile    uint32_t    PLLCFGR;
    volatile    uint32_t    PLLSAI1CFGR;
    volatile    uint32_t    PLLSAI2CFGR;
    volatile    uint32_t    CIER;
    volatile    uint32_t    CIFR;
    volatile    uint32_t    CICR;
    volatile    uint32_t    RESERVED0;
    volatile    uint32_t    AHB1RSTR;
    volatile    uint32_t    AHB2RSTR;
    volatile    uint32_t    AHB3RSTR;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    APB1RSTR1;
    volatile    uint32_t    APB1RSTR2;
    volatile    uint32_t    APB2RSTR;
    volatile    uint32_t    RESERVED2;
    volatile    uint32_t    AHB1ENR;
    volatile    uint32_t    AHB2ENR;
    volatile    uint32_t    AHB3ENR;
    volatile    uint32_t    RESERVED3;
    volatile    uint32_t    APB1ENR1;
    volatile    uint32_t    APB1ENR2;
    volatile    uint32_t    APB2ENR;
    volatile    uint32_t    RESERVED4;
    volatile    uint32_t    AHB1SMENR;
    volatile    uint32_t    AHB2SMENR;
    volatile    uint32_t    AHB3SMENR;
    volatile    uint32_t    RESERVED5;
    volatile    uint32_t    APB1SMENR1;
    volatile    uint32_t    APB1SMENR2;
    volatile    uint32_t    APB2SMENR;
    volatile    uint32_t    RESERVED6;
    volatile    uint32_t    CCIPR;
    volatile    uint32_t    RESERVED7;
    volatile    uint32_t    BDCR;
    volatile    uint32_t    CSR;
    volatile    uint32_t    CRRCR;
    volatile    uint32_t    CCIPR2;
} RCC_TypeDef;

#ifdef __cplusplus
#define RCC reinterpret_cast<RCC_TypeDef *>(0x40021000u)

#else
#define RCC ((RCC_TypeDef *)0x40021000u)
#endif

// CR Configuration

#define RCC_CR_MSION                    (0x1u<<0)
#define RCC_CR_MSIRDY                   (0x1u<<1)
#define RCC_CR_MSIPLLEN                 (0x1u<<2)
#define RCC_CR_MSIRGSEL                 (0x1u<<3)
#define RCC_CR_MSIRANGE                 (0xFu<<4)
#define RCC_CR_MSIRANGE_0               (0x1u<<4)
#define RCC_CR_HSION                    (0x1u<<8)
#define RCC_CR_HSIKERON                 (0x1u<<9)
#define RCC_CR_HSIRDY                   (0x1u<<10)
#define RCC_CR_HSIASFS                  (0x1u<<11)
#define RCC_CR_HSEON                    (0x1u<<16)
#define RCC_CR_HSERDY                   (0x1u<<17)
#define RCC_CR_HSEBYP                   (0x1u<<18)
#define RCC_CR_CSSON                    (0x1u<<19)
#define RCC_CR_PLLON                    (0x1u<<24)
#define RCC_CR_PLLRDY                   (0x1u<<25)
#define RCC_CR_PLLSAI1ON                (0x1u<<26)
#define RCC_CR_PLLSAI1RDY               (0x1u<<27)
#define RCC_CR_PLLSAI2ON                (0x1u<<28)
#define RCC_CR_PLLSAI2RDY               (0x1u<<29)

// ICSCR Configuration

#define RCC_ICSCR_MSICAL                (0xFFu<<0)
#define RCC_ICSCR_MSICAL_0              (0x1u<<0)
#define RCC_ICSCR_MSITRIM               (0xFFu<<8)
#define RCC_ICSCR_MSITRIM_0             (0x1u<<8)
#define RCC_ICSCR_HSICAL                (0xFFu<<16)
#define RCC_ICSCR_HSICAL_0              (0x1u<<16)
#define RCC_ICSCR_HSITRIM               (0x7Fu<<24)
#define RCC_ICSCR_HSITRIM_0             (0x1u<<24)

// CFGR Configuration

#define RCC_CFGR_SW                     (0x3u<<0)
#define RCC_CFGR_SW_0                   (0x1u<<0)
#define RCC_CFGR_SWS                    (0x3u<<2)
#define RCC_CFGR_SWS_0                  (0x1u<<2)
#define RCC_CFGR_HPRE                   (0xFu<<4)
#define RCC_CFGR_HPRE_0                 (0x1u<<4)
#define RCC_CFGR_PPRE1                  (0x7u<<8)
#define RCC_CFGR_PPRE1_0                (0x1u<<8)
#define RCC_CFGR_PPRE2                  (0x7u<<11)
#define RCC_CFGR_PPRE2_0                (0x1u<<11)
#define RCC_CFGR_STOPWUCK               (0x1u<<15)
#define RCC_CFGR_MCOSEL                 (0x7u<<24)
#define RCC_CFGR_MCOSEL_0               (0x1u<<24)
#define RCC_CFGR_MCOPRE                 (0x7u<<28)
#define RCC_CFGR_MCOPRE_0               (0x1u<<28)

// PLLCFGR Configuration

#define RCC_PLLCFGR_PLLSRC              (0x3u<<0)
#define RCC_PLLCFGR_PLLSRC_0            (0x1u<<0)
#define RCC_PLLCFGR_PLLM                (0xFu<<4)
#define RCC_PLLCFGR_PLLM_0              (0x1u<<4)
#define RCC_PLLCFGR_PLLN                (0x7Fu<<8)
#define RCC_PLLCFGR_PLLN_0              (0x1u<<8)
#define RCC_PLLCFGR_PLLPEN              (0x1u<<16)
#define RCC_PLLCFGR_PLLP                (0x1u<<17)
#define RCC_PLLCFGR_PLLQEN              (0x1u<<20)
#define RCC_PLLCFGR_PLLQ                (0x3u<<21)
#define RCC_PLLCFGR_PLLQ_0              (0x1u<<21)
#define RCC_PLLCFGR_PLLREN              (0x1u<<24)
#define RCC_PLLCFGR_PLLR                (0x3u<<25)
#define RCC_PLLCFGR_PLLR_0              (0x1u<<25)
#define RCC_PLLCFGR_PLLPDIV             (0x1Fu<<27)
#define RCC_PLLCFGR_PLLPDIV_0           (0x1u<<27)

