Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_rcc.h
// PLLSAI1CFGR Configuration

#define RCC_PLLSAI1CFGR_PLLSAI1M        (0xFu<<4)
#define RCC_PLLSAI1CFGR_PLLSAI1M_0      (0x1u<<4)
#define RCC_PLLSAI1CFGR_PLLSAI1N        (0x7Fu<<8)
#define RCC_PLLSAI1CFGR_PLLSAI1N_0      (0x1u<<8)
#define RCC_PLLSAI1CFGR_PLLSAI1PEN      (0x1u<<16)
#define RCC_PLLSAI1CFGR_PLLSAI1P        (0x1u<<17)
#define RCC_PLLSAI1CFGR_PLLSAI1QEN      (0x1u<<20)
#define RCC_PLLSAI1CFGR_PLLSAI1Q        (0x3u<<21)
#define RCC_PLLSAI1CFGR_PLLSAI1Q_0      (0x1u<<21)
#define RCC_PLLSAI1CFGR_PLLSAI1REN      (0x1u<<24)
#define RCC_PLLSAI1CFGR_PLLSAI1R        (0x3u<<25)
#define RCC_PLLSAI1CFGR_PLLSAI1R_0      (0x1u<<25)
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV     (0x1Fu<<27)
#define RCC_PLLSAI1CFGR_PLLSAI1PDIV_0   (0x1u<<27)

// PLLSAI2CFGR Configuration

#define RCC_PLLSAI2CFGR_PLLSAI2M        (0xFu<<4)
#define RCC_PLLSAI2CFGR_PLLSAI2M_0      (0x1u<<4)
#define RCC_PLLSAI2CFGR_PLLSAI2N        (0x7Fu<<8)
#define RCC_PLLSAI2CFGR_PLLSAI2N_0      (0x1u<<8)
#define RCC_PLLSAI2CFGR_PLLSAI2PEN      (0x1u<<16)
#define RCC_PLLSAI2CFGR_PLLSAI2P        (0x1u<<17)
#define RCC_PLLSAI2CFGR_PLLSAI2QEN      (0x1u<<20)
#define RCC_PLLSAI2CFGR_PLLSAI2Q        (0x3u<<21)
#define RCC_PLLSAI2CFGR_PLLSAI2Q_0      (0x1u<<21)
#define RCC_PLLSAI2CFGR_PLLSAI2REN      (0x1u<<24)
#define RCC_PLLSAI2CFGR_PLLSAI2R        (0x3u<<25)
#define RCC_PLLSAI2CFGR_PLLSAI2R_0      (0x1u<<25)
#define RCC_PLLSAI2CFGR_PLLSAI2PDIV     (0x1Fu<<27)
#define RCC_PLLSAI2CFGR_PLLSAI2PDIV_0   (0x1u<<27)

// CIER Configuration

#define RCC_CIER_HSI48RDYIE             (0x1u<<10)
#define RCC_CIER_LSECSSIE               (0x1u<<9)
#define RCC_CIER_PLLSAI2RDYIE           (0x1u<<7)
#define RCC_CIER_PLLSAI1RDYIE           (0x1u<<6)
#define RCC_CIER_PLLRDYIE               (0x1u<<5)
#define RCC_CIER_HSERDYIE               (0x1u<<4)
#define RCC_CIER_HSIRDYIE               (0x1u<<3)
#define RCC_CIER_MSIRDYIE               (0x1u<<2)
#define RCC_CIER_LSERDYIE               (0x1u<<1)
#define RCC_CIER_LSIRDYIE               (0x1u<<0)

// CIFR Configuration

#define RCC_CIFR_HSI48RDYF              (0x1u<<10)
#define RCC_CIFR_LSECSSF                (0x1u<<9)
#define RCC_CIFR_CSSF                   (0x1u<<8)
#define RCC_CIFR_PLLSAI2RDYF            (0x1u<<7)
#define RCC_CIFR_PLLSAI1RDYF            (0x1u<<6)
#define RCC_CIFR_PLLRDYF                (0x1u<<5)
#define RCC_CIFR_HSERDYF                (0x1u<<4)
#define RCC_CIFR_HSIRDYF                (0x1u<<3)
#define RCC_CIFR_MSIRDYF                (0x1u<<2)
#define RCC_CIFR_LSERDYF                (0x1u<<1)
#define RCC_CIFR_LSIRDYF                (0x1u<<0)

// CICR Configuration

#define RCC_CICR_HSI48RDYC              (0x1u<<10)
#define RCC_CICR_LSECSSC                (0x1u<<9)
#define RCC_CICR_CSSC                   (0x1u<<8)
#define RCC_CICR_PLLSAI2RDYC            (0x1u<<7)
#define RCC_CICR_PLLSAI1RDYC            (0x1u<<6)
#define RCC_CICR_PLLRDYC                (0x1u<<5)
#define RCC_CICR_HSERDYC                (0x1u<<4)
#define RCC_CICR_HSIRDYC                (0x1u<<3)
#define RCC_CICR_MSIRDYC                (0x1u<<2)
#define RCC_CICR_LSERDYC                (0x1u<<1)
#define RCC_CICR_LSIRDYC                (0x1u<<0)

// AHB1RSTR Configuration

#define RCC_AHB1RSTR_GFXMMURST          (0x1u<<18)
#define RCC_AHB1RSTR_DMA2DRST           (0x1u<<17)
#define RCC_AHB1RSTR_TSCRST             (0x1u<<16)
#define RCC_AHB1RSTR_CRCRST             (0x1u<<12)
#define RCC_AHB1RSTR_FLASHRST           (0x1u<<8)
#define RCC_AHB1RSTR_DMAMUX1RST         (0x1u<<2)
#define RCC_AHB1RSTR_DMA2RST            (0x1u<<1)
#define RCC_AHB1RSTR_DMA1RST            (0x1u<<0)

// AHB2RSTR Configuration

#define RCC_AHB2RSTR_SDMMC1RST          (0x1u<<22)
#define RCC_AHB2RSTR_OSPIMRST           (0x1u<<20)
#define RCC_AHB2RSTR_RNGRST             (0x1u<<18)
#define RCC_AHB2RSTR_HASHRST            (0x1u<<17)
#define RCC_AHB2RSTR_AESRST             (0x1u<<16)
#define RCC_AHB2RSTR_DCMIRST            (0x1u<<14)
#define RCC_AHB2RSTR_ADCRST             (0x1u<<13)
#define RCC_AHB2RSTR_OTGFSRST           (0x1u<<12)
#define RCC_AHB2RSTR_GPIOIRST           (0x1u<<8)
#define RCC_AHB2RSTR_GPIOHRST           (0x1u<<7)
#define RCC_AHB2RSTR_GPIOGRST           (0x1u<<6)
#define RCC_AHB2RSTR_GPIOFRST           (0x1u<<5)
#define RCC_AHB2RSTR_GPIOERST           (0x1u<<4)
#define RCC_AHB2RSTR_GPIODRST           (0x1u<<3)
#define RCC_AHB2RSTR_GPIOCRST           (0x1u<<2)
#define RCC_AHB2RSTR_GPIOBRST           (0x1u<<1)
#define RCC_AHB2RSTR_GPIOARST           (0x1u<<0)

// AHB3RSTR Configuration

#define RCC_AHB3RSTR_OSPI2RST           (0x1u<<9)
#define RCC_AHB3RSTR_FMCRST             (0x1u<<0)

// APB1RSTR1 Configuration

#define RCC_APB1RSTR1_TIM2RST           (0x1u<<0)
#define RCC_APB1RSTR1_TIM3RST           (0x1u<<1)
#define RCC_APB1RSTR1_TIM4RST           (0x1u<<2)
#define RCC_APB1RSTR1_TIM5RST           (0x1u<<3)
#define RCC_APB1RSTR1_TIM6RST           (0x1u<<4)
#define RCC_APB1RSTR1_TIM7RST           (0x1u<<5)
#define RCC_APB1RSTR1_SPI2RST           (0x1u<<14)
#define RCC_APB1RSTR1_SPI3RST           (0x1u<<15)
#define RCC_APB1RSTR1_USART2RST         (0x1u<<17)
#define RCC_APB1RSTR1_USART3RST         (0x1u<<18)
#define RCC_APB1RSTR1_UART4RST          (0x1u<<19)
#define RCC_APB1RSTR1_UART5RST          (0x1u<<20)
#define RCC_APB1RSTR1_I2C1RST           (0x1u<<21)
#define RCC_APB1RSTR1_I2C2RST           (0x1u<<22)
#define RCC_APB1RSTR1_I2C3RST           (0x1u<<23)
#define RCC_APB1RSTR1_CRSRST            (0x1u<<24)
#define RCC_APB1RSTR1_CAN1RST           (0x1u<<25)
#define RCC_APB1RSTR1_PWRRST            (0x1u<<28)
#define RCC_APB1RSTR1_DAC1RST           (0x1u<<29)
#define RCC_APB1RSTR1_OPAMPRST          (0x1u<<30)
#define RCC_APB1RSTR1_LPTIM1RST         (0x1u<<31)

// APB1RSTR2 Configuration

#define RCC_APB1RSTR2_LPTIM2RST         (0x1u<<5)
#define RCC_APB1RSTR2_I2C4RST           (0x1u<<1)
#define RCC_APB1RSTR2_LPUART1RST        (0x1u<<0)

// APB2RSTR Configuration

#define RCC_APB2RSTR_DSIRST             (0x1u<<27)
#define RCC_APB2RSTR_LTDCRST            (0x1u<<26)
#define RCC_APB2RSTR_DFSDM1RST          (0x1u<<24)
#define RCC_APB2RSTR_SAI2RST            (0x1u<<22)
#define RCC_APB2RSTR_SAI1RST            (0x1u<<21)
#define RCC_APB2RSTR_TIM17RST           (0x1u<<18)
#define RCC_APB2RSTR_TIM16RST           (0x1u<<17)
#define RCC_APB2RSTR_TIM15RST           (0x1u<<16)
#define RCC_APB2RSTR_USART1RST          (0x1u<<14)
#define RCC_APB2RSTR_TIM8RST            (0x1u<<13)
#define RCC_APB2RSTR_SPI1RST            (0x1u<<12)
#define RCC_APB2RSTR_TIM1RST            (0x1u<<11)
#define RCC_APB2RSTR_SYSCFGRST          (0x1u<<0)

// AHB1ENR Configuration

#define RCC_AHB1ENR_GFXMMUEN            (0x1u<<18)
#define RCC_AHB1ENR_DMA2DEN             (0x1u<<17)
#define RCC_AHB1ENR_TSCEN               (0x1u<<16)
#define RCC_AHB1ENR_CRCEN               (0x1u<<12)
#define RCC_AHB1ENR_FLASHEN             (0x1u<<8)
#define RCC_AHB1ENR_DMAMUX1EN           (0x1u<<2)
#define RCC_AHB1ENR_DMA2EN              (0x1u<<1)
#define RCC_AHB1ENR_DMA1EN              (0x1u<<0)

// AHB2ENR Configuration

#define RCC_AHB2ENR_SDMMC1EN            (0x1u<<22)
#define RCC_AHB2ENR_OSPIMEN             (0x1u<<20)
#define RCC_AHB2ENR_RNGEN               (0x1u<<18)
#define RCC_AHB2ENR_HASHEN              (0x1u<<17)
#define RCC_AHB2ENR_AESEN               (0x1u<<16)
#define RCC_AHB2ENR_DCMIEN              (0x1u<<14)
#define RCC_AHB2ENR_ADCEN               (0x1u<<13)
#define RCC_AHB2ENR_OTGFSEN             (0x1u<<12)
#define RCC_AHB2ENR_GPIOIEN             (0x1u<<8)
#define RCC_AHB2ENR_GPIOHEN             (0x1u<<7)
#define RCC_AHB2ENR_GPIOGEN             (0x1u<<6)
#define RCC_AHB2ENR_GPIOFEN             (0x1u<<5)
#define RCC_AHB2ENR_GPIOEEN             (0x1u<<4)
#define RCC_AHB2ENR_GPIODEN             (0x1u<<3)
#define RCC_AHB2ENR_GPIOCEN             (0x1u<<2)
#define RCC_AHB2ENR_GPIOBEN             (0x1u<<1)
#define RCC_AHB2ENR_GPIOAEN             (0x1u<<0)

// AHB3ENR Configuration

#define RCC_AHB3ENR_OSPI2EN             (0x1u<<9)
#define RCC_AHB3ENR_FMCEN               (0x1u<<0)

// APB1ENR1 Configuration

