Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_rcc.h
#define RCC_APB1ENR1_LPTIM1EN           (0x1u<<31)
#define RCC_APB1ENR1_OPAMPEN            (0x1u<<30)
#define RCC_APB1ENR1_DAC1EN             (0x1u<<29)
#define RCC_APB1ENR1_PWREN              (0x1u<<28)
#define RCC_APB1ENR1_CAN1EN             (0x1u<<25)
#define RCC_APB1ENR1_CRSEN              (0x1u<<24)
#define RCC_APB1ENR1_I2C3EN             (0x1u<<23)
#define RCC_APB1ENR1_I2C2EN             (0x1u<<22)
#define RCC_APB1ENR1_I2C1EN             (0x1u<<21)
#define RCC_APB1ENR1_UART5EN            (0x1u<<20)
#define RCC_APB1ENR1_UART4EN            (0x1u<<19)
#define RCC_APB1ENR1_USART3EN           (0x1u<<18)
#define RCC_APB1ENR1_USART2EN           (0x1u<<17)
#define RCC_APB1ENR1_SP3EN              (0x1u<<15)
#define RCC_APB1ENR1_SPI2EN             (0x1u<<14)
#define RCC_APB1ENR1_WWDGEN             (0x1u<<11)
#define RCC_APB1ENR1_RTCAPBEN           (0x1u<<10)
#define RCC_APB1ENR1_TIM7EN             (0x1u<<5)
#define RCC_APB1ENR1_TIM6EN             (0x1u<<4)
#define RCC_APB1ENR1_TIM5EN             (0x1u<<3)
#define RCC_APB1ENR1_TIM4EN             (0x1u<<2)
#define RCC_APB1ENR1_TIM3EN             (0x1u<<1)
#define RCC_APB1ENR1_TIM2EN             (0x1u<<0)

// APB1ENR2 Configuration

#define RCC_APB1ENR2_LPTIM2EN           (0x1u<<5)
#define RCC_APB1ENR2_I2C4EN             (0x1u<<1)
#define RCC_APB1ENR2_LPUART1EN          (0x1u<<0)

// APB2ENR Configuration

#define RCC_APB2ENR_DSIEN               (0x1u<<27)
#define RCC_APB2ENR_LTDCEN              (0x1u<<26)
#define RCC_APB2ENR_DFSDM1EN            (0x1u<<24)
#define RCC_APB2ENR_SAI2EN              (0x1u<<22)
#define RCC_APB2ENR_SAI1EN              (0x1u<<21)
#define RCC_APB2ENR_TIM17EN             (0x1u<<18)
#define RCC_APB2ENR_TIM16EN             (0x1u<<17)
#define RCC_APB2ENR_TIM15EN             (0x1u<<16)
#define RCC_APB2ENR_USART1EN            (0x1u<<14)
#define RCC_APB2ENR_TIM8EN              (0x1u<<13)
#define RCC_APB2ENR_SPI1EN              (0x1u<<12)
#define RCC_APB2ENR_TIM1EN              (0x1u<<11)
#define RCC_APB2ENR_FWEN                (0x1u<<7)
#define RCC_APB2ENR_SYSCFGEN            (0x1u<<0)

// AHB1SMENR Configuration

#define RCC_AHB1SMENR_GFXMMUSMEN        (0x1u<<18)
#define RCC_AHB1SMENR_DMA2DSMEN         (0x1u<<17)
#define RCC_AHB1SMENR_TSCSMEN           (0x1u<<16)
#define RCC_AHB1SMENR_CRCSMEN           (0x1u<<12)
#define RCC_AHB1SMENR_SRAM1SMEN         (0x1u<<9)
#define RCC_AHB1SMENR_FLASHSMEN         (0x1u<<8)
#define RCC_AHB1SMENR_DMAMUX1SMEN       (0x1u<<2)
#define RCC_AHB1SMENR_DMA2SMEN          (0x1u<<1)
#define RCC_AHB1SMENR_DMA1SMEN          (0x1u<<0)

// AHB2SMENR Configuration

#define RCC_AHB2SMENR_SDMMC1SMEN        (0x1u<<22)
#define RCC_AHB2SMENR_OSPIMSMEN         (0x1u<<20)
#define RCC_AHB2SMENR_RNGSMEN           (0x1u<<18)
#define RCC_AHB2SMENR_HASHSMEN          (0x1u<<17)
#define RCC_AHB2SMENR_AESSMEN           (0x1u<<16)
#define RCC_AHB2SMENR_DCMISMEN          (0x1u<<14)
#define RCC_AHB2SMENR_ADCFSSMEN         (0x1u<<13)
#define RCC_AHB2SMENR_OTGFSSMEN         (0x1u<<12)
#define RCC_AHB2SMENR_SRAM3SMEN         (0x1u<<10)
#define RCC_AHB2SMENR_SRAM2SMEN         (0x1u<<9)
#define RCC_AHB2SMENR_GPIOISMEN         (0x1u<<8)
#define RCC_AHB2SMENR_GPIOHSMEN         (0x1u<<7)
#define RCC_AHB2SMENR_GPIOGSMEN         (0x1u<<6)
#define RCC_AHB2SMENR_GPIOFSMEN         (0x1u<<5)
#define RCC_AHB2SMENR_GPIOESMEN         (0x1u<<4)
#define RCC_AHB2SMENR_GPIODSMEN         (0x1u<<3)
#define RCC_AHB2SMENR_GPIOCSMEN         (0x1u<<2)
#define RCC_AHB2SMENR_GPIOBSMEN         (0x1u<<1)
#define RCC_AHB2SMENR_GPIOASMEN         (0x1u<<0)

// AHB3SMENR Configuration

#define RCC_AHB3SMENR_OCTOSPI2          (0x1u<<9)
#define RCC_AHB3SMENR_FMCSMEN           (0x1u<<0)

// APB1SMENR1 Configuration

#define RCC_APB1SMENR1_LPTIM1SMEN       (0x1u<<31)
#define RCC_APB1SMENR1_OPAMPSMEN        (0x1u<<30)
#define RCC_APB1SMENR1_DAC1SMEN         (0x1u<<29)
#define RCC_APB1SMENR1_PWRSMEN          (0x1u<<28)
#define RCC_APB1SMENR1_CAN1SMEN         (0x1u<<25)
#define RCC_APB1SMENR1_CRSSMEN          (0x1u<<24)
#define RCC_APB1SMENR1_I2C3SMEN         (0x1u<<23)
#define RCC_APB1SMENR1_I2C2SMEN         (0x1u<<22)
#define RCC_APB1SMENR1_I2C1SMEN         (0x1u<<21)
#define RCC_APB1SMENR1_UART5SMEN        (0x1u<<20)
#define RCC_APB1SMENR1_UART4SMEN        (0x1u<<19)
#define RCC_APB1SMENR1_USART3SMEN       (0x1u<<18)
#define RCC_APB1SMENR1_USART2SMEN       (0x1u<<17)
#define RCC_APB1SMENR1_SP3SMEN          (0x1u<<15)
#define RCC_APB1SMENR1_SPI2SMEN         (0x1u<<14)
#define RCC_APB1SMENR1_WWDGSMEN         (0x1u<<11)
#define RCC_APB1SMENR1_RTCAPBSMEN       (0x1u<<10)
#define RCC_APB1SMENR1_TIM7SMEN         (0x1u<<5)
#define RCC_APB1SMENR1_TIM6SMEN         (0x1u<<4)
#define RCC_APB1SMENR1_TIM5SMEN         (0x1u<<3)
#define RCC_APB1SMENR1_TIM4SMEN         (0x1u<<2)
#define RCC_APB1SMENR1_TIM3SMEN         (0x1u<<1)
#define RCC_APB1SMENR1_TIM2SMEN         (0x1u<<0)

// APB1SMENR2 Configuration

#define RCC_APB1SMENR2_LPTIM2SMEN       (0x1u<<5)
#define RCC_APB1SMENR2_I2C4SMEN         (0x1u<<1)
#define RCC_APB1SMENR2_LPUART1SMEN      (0x1u<<0)

// APB2SMENR Configuration

#define RCC_APB2SMENR_DSISMEN           (0x1u<<27)
#define RCC_APB2SMENR_LTDCSMEN          (0x1u<<26)
#define RCC_APB2SMENR_DFSDM1SMEN        (0x1u<<24)
#define RCC_APB2SMENR_SAI2SMEN          (0x1u<<22)
#define RCC_APB2SMENR_SAI1SMEN          (0x1u<<21)
#define RCC_APB2SMENR_TIM17SMEN         (0x1u<<18)
#define RCC_APB2SMENR_TIM16SMEN         (0x1u<<17)
#define RCC_APB2SMENR_TIM15SMEN         (0x1u<<16)
#define RCC_APB2SMENR_USART1SMEN        (0x1u<<14)
#define RCC_APB2SMENR_TIM8SMEN          (0x1u<<13)
#define RCC_APB2SMENR_SPI1SMEN          (0x1u<<12)
#define RCC_APB2SMENR_TIM1SMEN          (0x1u<<11)
#define RCC_APB2SMENR_SYSCFGSMEN        (0x1u<<0)

// CCIPR Configuration

#define RCC_CCIPR_USART1SEL             (0x3u<<0)
#define RCC_CCIPR_USART1SEL_0           (0x1u<<0)
#define RCC_CCIPR_USART2SEL             (0x3u<<2)
#define RCC_CCIPR_USART2SEL_0           (0x1u<<2)
#define RCC_CCIPR_USART3SEL             (0x3u<<4)
#define RCC_CCIPR_USART3SEL_0           (0x1u<<4)
#define RCC_CCIPR_UART4SEL              (0x3u<<6)
#define RCC_CCIPR_UART4SEL_0            (0x1u<<6)
#define RCC_CCIPR_UART5SEL              (0x3u<<8)
#define RCC_CCIPR_UART5SEL_0            (0x1u<<8)
#define RCC_CCIPR_LPUART1SEL            (0x3u<<10)
#define RCC_CCIPR_LPUART1SEL_0          (0x1u<<10)
#define RCC_CCIPR_I2C1SEL               (0x3u<<12)
#define RCC_CCIPR_I2C1SEL_0             (0x1u<<12)
#define RCC_CCIPR_I2C2SEL               (0x3u<<14)
#define RCC_CCIPR_I2C2SEL_0             (0x1u<<14)
#define RCC_CCIPR_I2C3SEL               (0x3u<<16)
#define RCC_CCIPR_I2C3SEL_0             (0x1u<<16)
#define RCC_CCIPR_LPTIM1SEL             (0x3u<<18)
#define RCC_CCIPR_LPTIM1SEL_0           (0x1u<<18)
#define RCC_CCIPR_LPTIM2SEL             (0x3u<<20)
#define RCC_CCIPR_LPTIM2SEL_0           (0x1u<<20)
#define RCC_CCIPR_SAI1SEL               (0x3u<<22)
#define RCC_CCIPR_SAI1SEL_0             (0x1u<<22)
#define RCC_CCIPR_SAI2SEL               (0x3u<<24)
#define RCC_CCIPR_SAI2SEL_0             (0x1u<<24)
#define RCC_CCIPR_CLK48SEL              (0x3u<<26)
#define RCC_CCIPR_CLK48SEL_0            (0x1u<<26)
#define RCC_CCIPR_ADCSEL                (0x3u<<28)
#define RCC_CCIPR_ADCSEL_0              (0x1u<<28)

