Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32L4R5/Includes/Registers/stm32L4R5_rcc.h
// BDCR Configuration

#define RCC_BDCR_LSEON                  (0x1u<<0)
#define RCC_BDCR_LSERDY                 (0x1u<<1)
#define RCC_BDCR_LSEBYP                 (0x1u<<2)
#define RCC_BDCR_LSEDRV                 (0x3u<<3)
#define RCC_BDCR_LSEDRV_0               (0x1u<<3)
#define RCC_BDCR_LSECSSON               (0x1u<<5)
#define RCC_BDCR_LSECSSD                (0x1u<<6)
#define RCC_BDCR_RTCSEL                 (0x3u<<8)
#define RCC_BDCR_RTCSEL_0               (0x1u<<8)
#define RCC_BDCR_RTCEN                  (0x1u<<15)
#define RCC_BDCR_BDRST                  (0x1u<<16)
#define RCC_BDCR_LSCOEN                 (0x1u<<24)
#define RCC_BDCR_LSCOSEL                (0x1u<<25)

// CSR Configuration

#define RCC_CSR_LSION                   (0x1u<<0)
#define RCC_CSR_LSIRDY                  (0x1u<<1)
#define RCC_CSR_MSISRANGE               (0xFu<<8)
#define RCC_CSR_MSISRANGE_0             (0x1u<<8)
#define RCC_CSR_RMVF                    (0x1u<<23)
#define RCC_CSR_FWRSTF                  (0x1u<<24)
#define RCC_CSR_OBLRSTF                 (0x1u<<25)
#define RCC_CSR_PINRSTF                 (0x1u<<26)
#define RCC_CSR_BORRSTF                 (0x1u<<27)
#define RCC_CSR_SFTRSTF                 (0x1u<<28)
#define RCC_CSR_IWDGRSTF                (0x1u<<29)
#define RCC_CSR_WWDGRSTF                (0x1u<<30)
#define RCC_CSR_LPWRSTF                 (0x1u<<31)

// CRRCR Configuration

#define RCC_CRRCR_HSI48CAL              (0x1FFu<<7)
#define RCC_CRRCR_HSI48CAL_0            (0x1u<<7)
#define RCC_CRRCR_HSI48RDY              (0x1u<<1)
#define RCC_CRRCR_HSI48ON               (0x1u<<0)

// CCIPR2 Configuration

#define RCC_CCIPR2_OSPISEL              (0x3u<<20)
#define RCC_CCIPR2_OSPISEL_0            (0x1u<<20)
#define RCC_CCIPR2_PLLSAI2DIVR          (0x3u<<16)
#define RCC_CCIPR2_PLLSAI2DIVR_0        (0x1u<<16)
#define RCC_CCIPR2_SDMMCSEL             (0x1u<<14)
#define RCC_CCIPR2_DSISEL               (0x1u<<12)
#define RCC_CCIPR2_SAI2SEL              (0x7u<<8)
#define RCC_CCIPR2_SAI2SEL_0            (0x1u<<8)
#define RCC_CCIPR2_SAI1SEL              (0x7u<<5)
#define RCC_CCIPR2_SAI1SEL_0            (0x1u<<5)
#define RCC_CCIPR2_ADFSDMSEL            (0x3u<<3)
#define RCC_CCIPR2_ADFSDMSEL_0          (0x1u<<3)
#define RCC_CCIPR2_DFSDMSEL             (0x1u<<2)
#define RCC_CCIPR2_I2C4SEL              (0x3u<<0)
#define RCC_CCIPR2_I2C4SEL_0            (0x1u<<0)
